#pragma once

// Name: AceCombat7, Version: 1.3.0

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// Class Nimbus.Texture3DUIActor
// 0x0028 (0x0390 - 0x0368)
class ATexture3DUIActor : public AActor
{
public:
	class UMaterialBillboardComponent*                 TextureBox;                                               // 0x0368(0x0008) (Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	class UMaterialInterface*                          TextureBoxMaterial;                                       // 0x0370(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UMaterialInstanceDynamic*                    TextureBoxMaterialInst;                                   // 0x0378(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UTexture2D*                                  CurrentTexture;                                           // 0x0380(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0388(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Nimbus.Texture3DUIActor");
		return ptr;
	}

};


// Class Nimbus.AerialRefuel3DUIActor
// 0x0108 (0x0498 - 0x0390)
class AAerialRefuel3DUIActor : public ATexture3DUIActor
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0390(0x0008) MISSED OFFSET
	class UMaterialInterface*                          TextMaterial;                                             // 0x0398(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UMaterialInterface*                          TextMaterialVR;                                           // 0x03A0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UFont*                                       TextFont;                                                 // 0x03A8(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UFont*                                       TextFontVR;                                               // 0x03B0(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UMaterialInstanceDynamic*                    WidthAlignmentMaterialInst;                               // 0x03B8(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UMaterialInstanceDynamic*                    HeightAlignmentMaterialInst;                              // 0x03C0(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UTextRenderComponent*                        WidthAlignmentText;                                       // 0x03C8(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UTextRenderComponent*                        HeightAlignmentText;                                      // 0x03D0(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	float                                              TextScreenHeight;                                         // 0x03D8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              VRTextScreenHeight;                                       // 0x03DC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              WidthAlignmentYOffsetScale;                               // 0x03E0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              WidthAlignmentXOffset;                                    // 0x03E4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x03E8(0x0004) MISSED OFFSET
	struct FLinearColor                                AerialRefuelHUDColor;                                     // 0x03EC(0x0010) (Edit, BlueprintVisible, IsPlainOldData)
	unsigned char                                      UnknownData02[0x4];                                       // 0x03FC(0x0004) MISSED OFFSET
	class UTexture2D*                                  AerialRefuelDiamondTexture;                               // 0x0400(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UTexture2D*                                  AerialRefuelDottedTexture;                                // 0x0408(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UTexture2D*                                  AerialRefuelSolidTexture;                                 // 0x0410(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UMaterialInterface*                          AerialRefuelMaterial;                                     // 0x0418(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UMaterialInstanceDynamic*                    AerialRefuelPlayerInst;                                   // 0x0420(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UMaterialInstanceDynamic*                    AerialRefuelTargetInst;                                   // 0x0428(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UMaterialInstanceDynamic*                    AerialRefuelDottedInst;                                   // 0x0430(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UMaterialInstanceDynamic*                    AerialRefuelSolidInst;                                    // 0x0438(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	float                                              AerialRefuelTextureScale;                                 // 0x0440(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              AerialRefuelVRTextureScale;                               // 0x0444(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	struct FVector                                     AerialRefuelGuideRelativePosition;                        // 0x0448(0x000C) (Edit, IsPlainOldData)
	float                                              AerialRefuelMinScaleLimit;                                // 0x0454(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              AerialRefuelMinDistanceSquaredLimit;                      // 0x0458(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              AerialRefuelMaxDistanceSquaredLimit;                      // 0x045C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              AerialRefuelTargetCentralizedBuffer;                      // 0x0460(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              AerialRefuelTargetSensitivity;                            // 0x0464(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              LimitCornerScale;                                         // 0x0468(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x2C];                                      // 0x046C(0x002C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Nimbus.AerialRefuel3DUIActor");
		return ptr;
	}

};


// Class Nimbus.AiasAvoidsObject
// 0x0050 (0x03B8 - 0x0368)
class AAiasAvoidsObject : public AActor
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0368(0x0008) MISSED OFFSET
	struct FVector                                     ApproachRange;                                            // 0x0370(0x000C) (Edit, IsPlainOldData)
	float                                              ApproachAttenuationGravity;                               // 0x037C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x8];                                       // 0x0380(0x0008) MISSED OFFSET
	struct FVector                                     ImpactRange;                                              // 0x0388(0x000C) (Edit, IsPlainOldData)
	float                                              UpperHeight;                                              // 0x0394(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              MiddleHeight;                                             // 0x0398(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              UpperFallSpeed;                                           // 0x039C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              LowerFallSpeed;                                           // 0x03A0(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x4];                                       // 0x03A4(0x0004) MISSED OFFSET
	class UArrowComponent*                             ArrowComponentUpperHeight;                                // 0x03A8(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UArrowComponent*                             ArrowComponentMiddleHeight;                               // 0x03B0(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Nimbus.AiasAvoidsObject");
		return ptr;
	}

};


// Class Nimbus.NimbusGameObjectComponent
// 0x0000 (0x00F0 - 0x00F0)
class UNimbusGameObjectComponent : public UActorComponent
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Nimbus.NimbusGameObjectComponent");
		return ptr;
	}

};


// Class Nimbus.AIComponentBase
// 0x0008 (0x00F8 - 0x00F0)
class UAIComponentBase : public UNimbusGameObjectComponent
{
public:
	class AAIGameObject*                               OwningAIGameObject;                                       // 0x00F0(0x0008) (ZeroConstructor, Transient, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Nimbus.AIComponentBase");
		return ptr;
	}

};


// Class Nimbus.AIASCommandComponent
// 0x0040 (0x0138 - 0x00F8)
class UAIASCommandComponent : public UAIComponentBase
{
public:
	struct FScriptMulticastDelegate                    OnActivateBarrier;                                        // 0x00F8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnStopBarrier;                                            // 0x0108(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	TArray<class UClass*>                              SpawnRectennaBarrierWeaponClassList;                      // 0x0118(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<TWeakObjectPtr<class ARectennaBarrier>>     SpawnBarrierList;                                         // 0x0128(0x0010) (ZeroConstructor)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Nimbus.AIASCommandComponent");
		return ptr;
	}


	void StopBarrier();
	void OnStopBarrier__DelegateSignature(class AGameObject* Owner);
	void OnReleaseBarrierWeapon();
	void OnActivateBarrier__DelegateSignature(class AGameObject* Owner);
	void ActivateBarrier(int InNumber);
};


// Class Nimbus.AIASDamagedStateComponent
// 0x02F8 (0x03E8 - 0x00F0)
class UAIASDamagedStateComponent : public UNimbusGameObjectComponent
{
public:
	struct FString                                     MeshComponentName;                                        // 0x00F0(0x0010) (Edit, ZeroConstructor)
	bool                                               bAreDamagedStatesCompounded;                              // 0x0100(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bActivateBeginning;                                       // 0x0101(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bShowOwnerComponent;                                      // 0x0102(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bEnableCheckGroundHit;                                    // 0x0103(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0104(0x0004) MISSED OFFSET
	struct FName                                       ChangeDamagedStateComponentName;                          // 0x0108(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	TArray<struct FDamagedStateInstance>               DamagedStateInstances;                                    // 0x0110(0x0010) (Edit, ZeroConstructor)
	struct FName                                       MeshMaterialDamageParameterName;                          // 0x0120(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UDamagedMainBodySpinParam*                   MainBodySpinParam;                                        // 0x0128(0x0008) (Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UDamagedBreakApartSequence*                  DamageBreakApartSequence;                                 // 0x0130(0x0008) (Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	TArray<struct FName>                               MainBodyTrailSocketNames;                                 // 0x0138(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     DestroyedBodyMeshComponentName;                           // 0x0148(0x0010) (Edit, ZeroConstructor)
	struct FString                                     DestroyedPartsMeshComponentName;                          // 0x0158(0x0010) (Edit, ZeroConstructor)
	struct FString                                     DestroyedStaticMeshComponentName;                         // 0x0168(0x0010) (Edit, ZeroConstructor)
	class UAkAudioEvent*                               FallingSoundPlayEvent;                                    // 0x0178(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UAkAudioEvent*                               FallingSoundStopEvent;                                    // 0x0180(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	struct FSeaExplosionInfo                           SeaExplosionInfo;                                         // 0x0188(0x0008) (Edit)
	TArray<struct FSeaExplosionVFXInfo>                SeaExplosionVFXInfo;                                      // 0x0190(0x0010) (Edit, ZeroConstructor)
	bool                                               bShowExtraDestroyedVFX;                                   // 0x01A0(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x01A1(0x0007) MISSED OFFSET
	TArray<struct FDamagedVFXInfo>                     ExtraVfxInfo;                                             // 0x01A8(0x0010) (Edit, ZeroConstructor)
	bool                                               bShowGroundDecal;                                         // 0x01B8(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x7];                                       // 0x01B9(0x0007) MISSED OFFSET
	struct FGroundDecalInfo                            GroundDecalInfo;                                          // 0x01C0(0x0020) (Edit)
	TArray<struct FAIASChildDelayDestructInfo>         ChildDelayDestructInfo;                                   // 0x01E0(0x0010) (Edit, ZeroConstructor)
	bool                                               bIsShownInFirstPersonView;                                // 0x01F0(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bIsShownInCockpitView;                                    // 0x01F1(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bIsShownInThirdPersonView;                                // 0x01F2(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x5];                                       // 0x01F3(0x0005) MISSED OFFSET
	class AGameObject*                                 OwnerGameObject;                                          // 0x01F8(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UMeshComponent*                              OwnerMesh;                                                // 0x0200(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	class UMeshComponent*                              OwnerDamagedMesh;                                         // 0x0208(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	class AAIPlane*                                    OwnerAIPlane;                                             // 0x0210(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UStaticMeshComponent*                        PlaneBodyMeshComponent;                                   // 0x0218(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	class USkeletalMeshComponent*                      DamagedBodyMeshComponent;                                 // 0x0220(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	class USkeletalMeshComponent*                      DamagedPartsMeshComponent;                                // 0x0228(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	class UStaticMeshComponent*                        DamagedStaticMeshComponent;                               // 0x0230(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData04[0x178];                                     // 0x0238(0x0178) MISSED OFFSET
	TArray<int>                                        PendingDeathVFXList;                                      // 0x03B0(0x0010) (ZeroConstructor, Transient)
	unsigned char                                      UnknownData05[0x10];                                      // 0x03C0(0x0010) MISSED OFFSET
	class UNimbusGameInstance*                         GameInstance;                                             // 0x03D0(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	TArray<class AAiasAvoidsObject*>                   CheckAiasAvoidsObject;                                    // 0x03D8(0x0010) (ZeroConstructor, Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Nimbus.AIASDamagedStateComponent");
		return ptr;
	}


	void OnVisibilityChanged(bool bVisibility);
	void OnRestored();
	void OnComponentHitSurface(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void ForceShowExtraDestroyedVFX();
	void DamageStateLifeSpanExpired(struct FDamagedStateInstance* DamagedStateInstance);
};


// Class Nimbus.AIASStateComponent
// 0x0080 (0x0178 - 0x00F8)
class UAIASStateComponent : public UAIComponentBase
{
public:
	TArray<struct FAIASPartsDestroyInfo>               PartsDestroyInfo;                                         // 0x00F8(0x0010) (Edit, ZeroConstructor)
	class UCurveVector*                                TiltingDOCMLocationCurve;                                 // 0x0108(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UCurveVector*                                TiltingDOCMRotationCurve;                                 // 0x0110(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UParticleSystem*                             TiltingDOCMParticle;                                      // 0x0118(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	struct FVector                                     TiltingDOCMParticleLocationOffset;                        // 0x0120(0x000C) (Edit, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x012C(0x0004) MISSED OFFSET
	class UParticleSystemComponent*                    TiltingDOCMParticleComponent;                             // 0x0130(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	class UStaticMeshComponent*                        PlaneBodyMeshComponent;                                   // 0x0138(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	class UStaticMeshComponent*                        DamagedBodyMeshComponent;                                 // 0x0140(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	class AAIGameObject*                               RectBaseObject;                                           // 0x0148(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData01[0x28];                                      // 0x0150(0x0028) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Nimbus.AIASStateComponent");
		return ptr;
	}


	void OnRestored();
};


// Class Nimbus.AIFireControlSystem
// 0x01A8 (0x02A0 - 0x00F8)
class UAIFireControlSystem : public UAIComponentBase
{
public:
	struct FScriptMulticastDelegate                    OnWeaponFired;                                            // 0x00F8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0108(0x0008) MISSED OFFSET
	float                                              EnemySearchLockRadius;                                    // 0x0110(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	float                                              EnemySearchLockRadiusSquared;                             // 0x0114(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	float                                              EnemySearchLossRadius;                                    // 0x0118(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	float                                              EnemySearchLossRadiusSquared;                             // 0x011C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	bool                                               bRegulateTick;                                            // 0x0120(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bIsHighPriority;                                          // 0x0121(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x2];                                       // 0x0122(0x0002) MISSED OFFSET
	float                                              MinRegulateTickDistanceUU;                                // 0x0124(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MaxRegulateTickDistanceUU;                                // 0x0128(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              HighPriorityMinTickInterval;                              // 0x012C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              HighPriorityMaxTickInterval;                              // 0x0130(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              LowPriorityMinTickInterval;                               // 0x0134(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              LowPriorityMaxTickInterval;                               // 0x0138(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	ETargetType                                        EnemySearchType;                                          // 0x013C(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x3];                                       // 0x013D(0x0003) MISSED OFFSET
	float                                              EnemySearchRefreshRateMin;                                // 0x0140(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              EnemySearchRefreshRateMax;                                // 0x0144(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x4];                                       // 0x0148(0x0004) MISSED OFFSET
	float                                              EnemyTargetUpdateRate;                                    // 0x014C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData04[0x8];                                       // 0x0150(0x0008) MISSED OFFSET
	float                                              LostTargetInCloudTime;                                    // 0x0158(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              LostTargetInCloudRecoveryTime;                            // 0x015C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UClass*                                      Weapon1;                                                  // 0x0160(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UClass*                                      Weapon2;                                                  // 0x0168(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UClass*                                      Weapon3;                                                  // 0x0170(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UClass*                                      FlareClass;                                               // 0x0178(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	int                                                FlareParticlePerActivation;                               // 0x0180(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              FlareParticlePeriod;                                      // 0x0184(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              FlareParticleMaxSpawnAngle;                               // 0x0188(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	struct FVector                                     FlareParticleSpawnPosition;                               // 0x018C(0x000C) (Edit, IsPlainOldData)
	struct FRotator                                    FlareParticleSpawnRotation;                               // 0x0198(0x000C) (Edit, IsPlainOldData)
	float                                              EnemySearchAngleLimit;                                    // 0x01A4(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData05[0x18];                                      // 0x01A8(0x0018) MISSED OFFSET
	class AActor*                                      EnemySearchFilter;                                        // 0x01C0(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class AGameObject*                                 ExceptionTarget;                                          // 0x01C8(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData06[0x8];                                       // 0x01D0(0x0008) MISSED OFFSET
	class AGameObject*                                 TrackingTarget;                                           // 0x01D8(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData07[0x70];                                      // 0x01E0(0x0070) MISSED OFFSET
	class AGameObject*                                 FCSLockedTarget;                                          // 0x0250(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData08[0x48];                                      // 0x0258(0x0048) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Nimbus.AIFireControlSystem");
		return ptr;
	}


	void SetInitialPose(const struct FVector& Location);
	void OnWeaponFired__DelegateSignature();
	bool CanActivateFlares();
};


// Class Nimbus.GameObject
// 0x0778 (0x0B40 - 0x03C8)
class AGameObject : public APawn
{
public:
	unsigned char                                      UnknownData00[0x20];                                      // 0x03C8(0x0020) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnTakeDamage;                                             // 0x03E8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnChildGameObjectDeath;                                   // 0x03F8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnChildGameObjectRecoveryTriggered;                       // 0x0408(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnChildGameObjectRecoveryEnded;                           // 0x0418(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnIdentified;                                             // 0x0428(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnVisibilityChanged;                                      // 0x0438(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnRestoredDelegate;                                       // 0x0448(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData01[0x50];                                      // 0x0458(0x0050) MISSED OFFSET
	class USphereComponent*                            OverlapCollision;                                         // 0x04A8(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class USphereComponent*                            SphereCollision;                                          // 0x04B0(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData02[0x8];                                       // 0x04B8(0x0008) MISSED OFFSET
	EGameObjectCategory                                GameObjectCategory;                                       // 0x04C0(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	EGameObjectSubCategory                             GameObjectSubCategory;                                    // 0x04C1(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData03[0x2];                                       // 0x04C2(0x0002) MISSED OFFSET
	float                                              MaxHealth;                                                // 0x04C4(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MinHealth;                                                // 0x04C8(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	float                                              Speed;                                                    // 0x04CC(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData04[0x10];                                      // 0x04D0(0x0010) MISSED OFFSET
	unsigned char                                      StealthLevel;                                             // 0x04E0(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData05[0x3];                                       // 0x04E1(0x0003) MISSED OFFSET
	int                                                KillBountyScore;                                          // 0x04E4(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bIsActivated;                                             // 0x04E8(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData06[0x1];                                       // 0x04E9(0x0001) MISSED OFFSET
	bool                                               bIsInvincible;                                            // 0x04EA(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData07[0x2];                                       // 0x04EB(0x0002) MISSED OFFSET
	bool                                               bIsReplayMode;                                            // 0x04ED(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bIsIGCMode;                                               // 0x04EE(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bIsShownDuringIGC;                                        // 0x04EF(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bIsAttackTargetsException;                                // 0x04F0(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData08[0x1];                                       // 0x04F1(0x0001) MISSED OFFSET
	bool                                               bIsExcludeFromGunAutoFire;                                // 0x04F2(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData09[0x5];                                       // 0x04F3(0x0005) MISSED OFFSET
	float                                              LookAheadTimeSec;                                         // 0x04F8(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData10[0x4];                                       // 0x04FC(0x0004) MISSED OFFSET
	struct FString                                     ObjNameID;                                                // 0x0500(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	struct FString                                     CallsignID;                                               // 0x0510(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	struct FString                                     SpeakerID;                                                // 0x0520(0x0010) (Edit, ZeroConstructor)
	unsigned char                                      UnknownData11[0x10];                                      // 0x0530(0x0010) MISSED OFFSET
	TArray<class AWeaponBase*>                         AttackingMainWeaponArray;                                 // 0x0540(0x0010) (ZeroConstructor, Transient)
	TArray<class AWeaponBase*>                         AttackingSpecialWeaponArray;                              // 0x0550(0x0010) (ZeroConstructor, Transient)
	class AGameObject*                                 LastAttackingSpecialWeaponOwner;                          // 0x0560(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData12[0x60];                                      // 0x0568(0x0060) MISSED OFFSET
	TArray<class AGameObject*>                         AttachedGameObjects;                                      // 0x05C8(0x0010) (ZeroConstructor, Transient)
	EMissileAlert                                      MissileAlert;                                             // 0x05D8(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bIsMissileAlertedByAI;                                    // 0x05D9(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData13[0x6];                                       // 0x05DA(0x0006) MISSED OFFSET
	class AWeaponBase*                                 AlertedWeapon;                                            // 0x05E0(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	TArray<class AGameObject*>                         PursuitAttackers;                                         // 0x05E8(0x0010) (ZeroConstructor, Transient)
	TArray<class AGameObject*>                         NonPursuitAttackers;                                      // 0x05F8(0x0010) (ZeroConstructor, Transient)
	class UParticleSystem*                             DeathVFX;                                                 // 0x0608(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UParticleSystem*                             StruckByLightningVFX;                                     // 0x0610(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAkAudioEvent*                               StruckByLightningSound;                                   // 0x0618(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     HitCenterOffset;                                          // 0x0620(0x000C) (Edit, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     PursuitPointOffset;                                       // 0x062C(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     LeadPointOffset;                                          // 0x0638(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData)
	float                                              FrontViewHalfConeAngle;                                   // 0x0644(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              AirCurrentPositionInfluenceModifier;                      // 0x0648(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              AirCurrentRotationInfluenceModifier;                      // 0x064C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              TimeToRecoverFromLightningStrike;                         // 0x0650(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              LightningAffectModifier;                                  // 0x0654(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData14[0x8];                                       // 0x0658(0x0008) MISSED OFFSET
	bool                                               bIsUnidentified;                                          // 0x0660(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData15[0x1];                                       // 0x0661(0x0001) MISSED OFFSET
	bool                                               bNeedsDetection;                                          // 0x0662(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData16[0x1];                                       // 0x0663(0x0001) MISSED OFFSET
	float                                              DetectionDistanceMeters;                                  // 0x0664(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData17[0x4];                                       // 0x0668(0x0004) MISSED OFFSET
	float                                              IdentifyDistanceMeters;                                   // 0x066C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData18[0x18];                                      // 0x0670(0x0018) MISSED OFFSET
	class UWeaponManager*                              WeaponManager;                                            // 0x0688(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData19[0x28];                                      // 0x0690(0x0028) MISSED OFFSET
	bool                                               bIsPlayerTarget;                                          // 0x06B8(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData20[0x167];                                     // 0x06B9(0x0167) MISSED OFFSET
	class AGameObject*                                 OwningParent;                                             // 0x0820(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class AGameObject*                                 ChildGameObjectParent;                                    // 0x0828(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData21[0x30];                                      // 0x0830(0x0030) MISSED OFFSET
	float                                              CloudEnterDensity;                                        // 0x0860(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              CloudExitDensity;                                         // 0x0864(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              TimeToDeactivateAfterDeath;                               // 0x0868(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData22[0xC];                                       // 0x086C(0x000C) MISSED OFFSET
	class ATargetContainer3DUIActor*                   TargetContainerActor;                                     // 0x0878(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData23[0xC8];                                      // 0x0880(0x00C8) MISSED OFFSET
	TMap<class AAirCurrentVolume*, struct FAirCurrentData> AirCurrentDataList;                                       // 0x0948(0x0050) (ZeroConstructor, Transient)
	unsigned char                                      UnknownData24[0x40];                                      // 0x0998(0x0040) MISSED OFFSET
	TArray<class UMeshComponent*>                      OverriddenForceLODMeshs;                                  // 0x09D8(0x0010) (ExportObject, ZeroConstructor, Transient)
	bool                                               bIsPersistentForceLOD;                                    // 0x09E8(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData25[0x1];                                       // 0x09E9(0x0001) MISSED OFFSET
	uint16_t                                           PilotDataID;                                              // 0x09EA(0x0002) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bEnableOverlapEvent;                                      // 0x09EC(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData26[0xB];                                       // 0x09ED(0x000B) MISSED OFFSET
	TArray<class UNimbusGameObjectComponent*>          GameObjectComponentsToTick;                               // 0x09F8(0x0010) (ExportObject, ZeroConstructor, Transient)
	TArray<struct FOneTimeFunc>                        SafelyCallBeforeTickComponentOneTimeFuncs;                // 0x0A08(0x0010) (ZeroConstructor, Transient)
	TArray<class ANimbusTriggerBase*>                  OverlappedNimbusTriggerActors;                            // 0x0A18(0x0010) (ZeroConstructor, Transient)
	struct FScriptMulticastDelegate                    OnNimbusBeginOverlap;                                     // 0x0A28(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnNimbusEndOverlap;                                       // 0x0A38(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	float                                              BackBlindZoneTransitionDuration;                          // 0x0A48(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData27[0xC];                                       // 0x0A4C(0x000C) MISSED OFFSET
	class UMeshComponent*                              GunHitMeshComponent;                                      // 0x0A58(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData28[0x40];                                      // 0x0A60(0x0040) MISSED OFFSET
	struct FName                                       OriginalCollisionProfileName;                             // 0x0AA0(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	struct FName                                       CurrentCollisionProfileName;                              // 0x0AA8(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData29[0x50];                                      // 0x0AB0(0x0050) MISSED OFFSET
	bool                                               bIsDeathCameraShake;                                      // 0x0B00(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	ENimbusCameraShakeType                             DeathCameraShakeType;                                     // 0x0B01(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bDrowHUDMessage;                                          // 0x0B02(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData30[0x1];                                       // 0x0B03(0x0001) MISSED OFFSET
	float                                              FullDisplayTimeAfterStealthAttack;                        // 0x0B04(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	float                                              ReturnToStealthTimeAfterStealthAttack;                    // 0x0B08(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData31[0x14];                                      // 0x0B0C(0x0014) MISSED OFFSET
	class AElectronicSupportMeasures*                  JammingMeasures;                                          // 0x0B20(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class AElectronicSupportMeasures*                  SupportMeasures;                                          // 0x0B28(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	int                                                HealthInternal;                                           // 0x0B30(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData32[0x4];                                       // 0x0B34(0x0004) MISSED OFFSET
	class ANimbusHUD*                                  NimbusHUDCache;                                           // 0x0B38(0x0008) (ZeroConstructor, Transient, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Nimbus.GameObject");
		return ptr;
	}


	void SetMinHealth(float InHealth);
	void SetIsUnidentified(bool bUnidentified);
	void SetIsInvincibleFromAI(bool bInvincible);
	void SetIsInvincible(bool bInvincible);
	void SetIsExcludeFromGunAutoFire(bool bExcludeFromGunAutoFire);
	void SetIsAttackTargetsException(bool bAttackTargetsException);
	void SetHudBoxAttribute(EHudBoxAttribute Type);
	void SetActive(bool bActive, bool bReset);
	void OnWeaponLocked();
	void OnWeaponDetectionLost();
	void OnWeaponDetectionAcquired();
	void OnVisibilityChanged__DelegateSignature(bool bVisibility);
	void OnTakeDamage__DelegateSignature(class AGameObject* Causer, class AGameObject* DamagedObject, class AWeaponBase* Weapon, float Damage, class AWeaponBase* WeaponTypeCDO);
	void OnSleepChanged__DelegateSignature();
	void OnRestoredDelegate__DelegateSignature();
	void OnRestored();
	void OnRepositionDelegate__DelegateSignature();
	void OnReposition();
	void OnMissileAlertStateChange(EMissileAlert NewState, class AActor* Attacker);
	void OnLockedOnByEnemy__DelegateSignature(class AGameObject* LockedObject, class AGameObject* EnemyObject);
	void OnIdentified__DelegateSignature();
	void OnHitByGun(class AActor* Attacker);
	void OnExecRecordableEvent(int EventID);
	void OnDeath(class AGameObject* DeadGameObject);
	void OnDeactivate();
	void OnChildGameObjectRecoveryTriggered__DelegateSignature(class AGameObject* ChildGameObject);
	void OnChildGameObjectRecoveryEnded__DelegateSignature(class AGameObject* ChildGameObject);
	void OnChildGameObjectDeath__DelegateSignature(class AGameObject* DeadChildGameObject);
	void OnAttackedBySpecialWeapon(bool isAttacked, class AActor* Attacker);
	void OnAttachedActorLockedOnByEnemy(class AGameObject* LockedObject, class AGameObject* EnemyObject);
	void OnActivate();
	float ModifyHealth(float InValue, class APawn* DamageCauser, bool bCauseDamageEvent);
	void K2_DestroyActor();
	bool IsStruckByLightning();
	bool IsPlayerTarget();
	bool IsNimbusOverlappingActor(class AActor* Other);
	bool IsAttackedBySpecialWeapon();
	bool IsAttackedByOpponent();
	bool IsAttackedByMainWeapon();
	bool IsAlive();
	bool IsActivated();
	class AUnit* GetUnit();
	int GetTrueSkyQueryID(int RelativeID);
	float GetSpeedMps();
	float GetSpeedKmph();
	struct FString GetSpeakerID();
	struct FVector GetPursuitPoint();
	struct FString GetObjNameID();
	struct FString GetObjName();
	void GetNimbusOverlappingActors(class UClass* ClassFilter, TArray<class AActor*>* OverlappingActors);
	float GetMinHealth();
	float GetMaxHealth();
	class AGameObject* GetLockedOnTarget();
	struct FVector GetLeadPoint();
	bool GetIsUnidentified();
	bool GetIsInStealth(const struct FVector& PlayerLocation, class AGameObject* GameObject);
	bool GetIsDetected();
	float GetHealth();
	float GetDamagePercentage();
	struct FString GetCallsignID();
	struct FString GetCallsign();
	TArray<class AWeaponBase*> GetAttackingMainWeaponArray();
	float GetAltitudeMeters();
	void ForceShowHudBoxInSand(bool bShow);
	void ForceDetection();
	void ExecRecordableEvent(int EventID);
	void EnableKDSMode(bool bIsEnabled);
	void EnableFriendlyFireDamage(bool bEnable);
};


// Class Nimbus.AIGameObject
// 0x01A0 (0x0CE0 - 0x0B40)
class AAIGameObject : public AGameObject
{
public:
	struct FScriptMulticastDelegate                    OnStartedMovingOnPath;                                    // 0x0B40(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnReachedPathEntryPoint;                                  // 0x0B50(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnReachedPathPoint;                                       // 0x0B60(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnFinishedMovingOnPath;                                   // 0x0B70(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnResetPath;                                              // 0x0B80(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	class AUnit*                                       Unit;                                                     // 0x0B90(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UAIFireControlSystem*                        FCS;                                                      // 0x0B98(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData)
	class UAIPathComponent*                            AIPathComp;                                               // 0x0BA0(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	unsigned char                                      AILevel;                                                  // 0x0BA8(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0BA9(0x0007) MISSED OFFSET
	class UDataTable*                                  AIPilotDataTable;                                         // 0x0BB0(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UDataTable*                                  AIParamDataTable;                                         // 0x0BB8(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UDataTable*                                  AIParamModifierDataTable;                                 // 0x0BC0(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UDataTable*                                  AIFlaresDataTable;                                        // 0x0BC8(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UDataTable*                                  AIWeaponDurabilityDataTable;                              // 0x0BD0(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UDataTable*                                  AIWeaponExplosionDurabilityDataTable;                     // 0x0BD8(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x50];                                      // 0x0BE0(0x0050) MISSED OFFSET
	bool                                               bScaleLevelWithDifficulty;                                // 0x0C30(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bShouldShowInBriefing;                                    // 0x0C31(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bIsFocusableInBriefing;                                   // 0x0C32(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bIsTgtInBriefing;                                         // 0x0C33(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bShouldRecordForDebriefing;                               // 0x0C34(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bForceDisplayObjNameIDForDebriefing;                      // 0x0C35(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bShowHUDBox;                                              // 0x0C36(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData02[0x2];                                       // 0x0C37(0x0002) MISSED OFFSET
	bool                                               bPermissionToEngage;                                      // 0x0C39(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bPermissionToFire;                                        // 0x0C3A(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bPermissionToUseFlares;                                   // 0x0C3B(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bPermissionToProvoke;                                     // 0x0C3C(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bPermissionToEvade;                                       // 0x0C3D(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bIgnoreAttackQuota;                                       // 0x0C3E(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bIsTGT;                                                   // 0x0C3F(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bIsAir;                                                   // 0x0C40(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bIsSea;                                                   // 0x0C41(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bIsMissionSpecialObject;                                  // 0x0C42(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
